storage/tests/56f55153-c2c9-491d-b623-19cfa1b6f590/k6.log

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: /home/user/Desktop/simple load testing/backend/storage/tests/56f55153-c2c9-491d-b623-19cfa1b6f590/script.js
        output: -

     scenarios: (100.00%) 1 scenario, 10 max VUs, 40s max duration (incl. graceful stop):
              * default: 10 looping VUs for 10s (gracefulStop: 30s)


running (01.0s), 10/10 VUs, 0 complete and 0 interrupted iterations
default   [  10% ] 10 VUs  01.0s/10s

running (02.0s), 10/10 VUs, 0 complete and 0 interrupted iterations
default   [  20% ] 10 VUs  02.0s/10s

running (03.0s), 10/10 VUs, 0 complete and 0 interrupted iterations
default   [  30% ] 10 VUs  03.0s/10s

running (04.0s), 10/10 VUs, 0 complete and 0 interrupted iterations
default   [  40% ] 10 VUs  04.0s/10s

running (05.0s), 10/10 VUs, 0 complete and 0 interrupted iterations
default   [  50% ] 10 VUs  05.0s/10s

running (06.0s), 10/10 VUs, 0 complete and 0 interrupted iterations
default   [  60% ] 10 VUs  06.0s/10s

running (07.0s), 10/10 VUs, 0 complete and 0 interrupted iterations
default   [  70% ] 10 VUs  07.0s/10s

running (08.0s), 10/10 VUs, 0 complete and 0 interrupted iterations
default   [  80% ] 10 VUs  08.0s/10s

running (09.0s), 10/10 VUs, 0 complete and 0 interrupted iterations
default   [  90% ] 10 VUs  09.0s/10s

running (10.0s), 10/10 VUs, 0 complete and 0 interrupted iterations
default   [ 100% ] 10 VUs  10.0s/10s

running (11.0s), 10/10 VUs, 0 complete and 0 interrupted iterations
default ↓ [ 100% ] 10 VUs  10s

running (12.0s), 10/10 VUs, 0 complete and 0 interrupted iterations
default ↓ [ 100% ] 10 VUs  10s

running (13.0s), 10/10 VUs, 0 complete and 0 interrupted iterations
default ↓ [ 100% ] 10 VUs  10s

running (14.0s), 09/10 VUs, 1 complete and 0 interrupted iterations
default ↓ [ 100% ] 10 VUs  10s

running (15.0s), 07/10 VUs, 3 complete and 0 interrupted iterations
default ↓ [ 100% ] 10 VUs  10s

running (16.0s), 03/10 VUs, 7 complete and 0 interrupted iterations
default ↓ [ 100% ] 10 VUs  10s

running (17.0s), 02/10 VUs, 8 complete and 0 interrupted iterations
default ↓ [ 100% ] 10 VUs  10s

running (18.0s), 01/10 VUs, 9 complete and 0 interrupted iterations
default ↓ [ 100% ] 10 VUs  10s


  █ TOTAL RESULTS 

    checks_total.......: 60     3.304791/s
    checks_succeeded...: 91.66% 55 out of 60
    checks_failed......: 8.33%  5 out of 60

    ✗ status ok
      ↳  91% — ✓ 55 / ✗ 5

    HTTP
    http_req_duration..............: avg=174.06ms min=4.68ms med=7.97ms max=1.18s  p(90)=428.46ms p(95)=798.02ms
      { expected_response:true }...: avg=127.93ms min=4.68ms med=7.47ms max=1.11s  p(90)=385.24ms p(95)=515.59ms
    http_req_failed................: 8.33% 5 out of 60
    http_reqs......................: 60    3.304791/s

    EXECUTION
    iteration_duration.............: avg=15.71s   min=13.65s med=15.53s max=18.15s p(90)=17.29s   p(95)=17.72s  
    iterations.....................: 10    0.550799/s
    vus............................: 1     min=1       max=10
    vus_max........................: 10    min=10      max=10

    NETWORK
    data_received..................: 25 kB 1.4 kB/s
    data_sent......................: 18 kB 1.0 kB/s



running (18.2s), 00/10 VUs, 10 complete and 0 interrupted iterations
default ✓ [ 100% ] 10 VUs  10s